# 态势信息
obs = {
    "sim_time": 672.6,
    "red": {
        "airports": [
            {
                "type": "AIRPORT",    # 信息类型-机场
                "ID": 30001,          # 机场编号
                "JB": 1,              # 军别信息(0-蓝方, 1-红方)
                "CA": 50,             # 容量(单位: 架, 下同)
                "NM": 16,             # 机场停放飞机数量
                "KY": 16,             # 可用飞机总数
                "AIR": 6,             # 可用歼击机数量
                "AWCS": 0,            # 可用预警机数量
                "JAM": 0,             # 可用干扰机数量
                "UAV": 2,             # 可用无人侦察机数量
                "BOM": 8,             # 可用轰炸机数量
                "X": 146228.0,        # 机场x轴坐标(单位: 米, 下同)
                "Y": -1965.0,         # 机场y轴坐标
                "Z": 12.1,            # 机场z轴坐标
                "WH": 1,              # 是否存活(机场存活信息一直为1)
                "DA": 0               # 机场修复时间(整型, 单位: 秒)
            }
        ],
        "teams": [
            {
                "type": "TEAMS",        # 信息类型
                "Task": "",             # 上一指令信息(json串形式, 默认为"")
                "TMID": 9359,           # 编队编号(整型, 下同)
                "ST": 0,                # 编队状态编码
                "LX": 32,               # 编队类型编码(整型, 这里32为地面雷达)
                "JB": 1,                # 军别(0-蓝方, 1-红方)
                "Num": 1,               # 编队内平台数量(整型)
                "PT": [[4069, 1]]       # 编队内平台列表[[平台编号, 队内序号], ...]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"Ship_Move_Deploy\", \"self_id\": 2901, \"point_x\": 5000, \"point_y\": 65000, \"point_z\": 0, \"direction\": 90, \"radar_state\": 1}",
                "TMID": 6048,
                "ST": 40,
                "LX": 21,
                "JB": 1,
                "Num": 1,
                "PT": [[2901, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"awcs_areapatrol\", \"self_id\": 4959, \"point_x\": 25000, \"point_y\": 0, \"point_z\": 7500, \"direction\": 270, \"length\": 20000, \"width\": 20000, \"speed\": 160, \"patrol_time\": 7200, \"patrol_mode\": 2}",
                "TMID": 5749,
                "ST": 51,
                "LX": 12,
                "JB": 1,
                "Num": 1,
                "PT": [[4959, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"Ship_Move_Deploy\", \"self_id\": 168, \"point_x\": 15000, \"point_y\": 0, \"point_z\": 0, \"direction\": 90, \"radar_state\": 1}",
                "TMID": 9029,
                "ST": 40,
                "LX": 21,
                "JB": 1,
                "Num": 1,
                "PT": [[168, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 5249,
                "ST": 0,
                "LX": 14,
                "JB": 1,
                "Num": 1,
                "PT": [[1305, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"airattack\", \"self_id\": 4979, \"target_id\": 1549, \"type\": 0}",
                "TMID": 7080,
                "ST": 16,
                "LX": 11,
                "JB": 1,
                "Num": 2,
                "PT": [[4979, 1], [4359, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"line_disturb_patrol\", \"self_id\": 9667, \"speed\": 160, \"area\": {\"area_id\": 0, \"area_type\": \"line\", \"point_num\": 3, \"point_list\": [{\"x\": 45000, \"y\": 0, \"z\": 8500}, {\"x\": 25000, \"y\": 50000, \"z\": 8500}, {\"x\": -45000, \"y\": 55000, \"z\": 8500}]}}",
                "TMID": 9667,
                "ST": 61,
                "LX": 13,
                "JB": 1,
                "Num": 1,
                "PT": [[2488, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffprotect\", \"airport_id\": 30001, \"fly_num\": 2, \"cov_id\": 9667, \"flag\": 1, \"offset\": 100, \"speed\": 250}",
                "TMID": 8509,
                "ST": 18,
                "LX": 11,
                "JB": 1,
                "Num": 2,
                "PT": [[1948, 1], [4247, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 30001, \"fly_num\": 2, \"fly_type\": 11, \"point_x\": -105000, \"point_y\": 0, \"point_z\": 8000, \"direction\": 270, \"length\": 10000, \"width\": 10000, \"speed\": 160, \"patrol_time\": 7200}",
                "TMID": 5475,
                "ST": 18,
                "LX": 11,
                "JB": 1,
                "Num": 2,
                "PT": [[1140, 1], [4663, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 30001, \"fly_num\": 2, \"fly_type\": 11, \"point_x\": -105001, \"point_y\": 0, \"point_z\": 8000, \"direction\": 270, \"length\": 10000, \"width\": 10000, \"speed\": 160, \"patrol_time\": 7200}",
                "TMID": 5285,
                "ST": 18,
                "LX": 11,
                "JB": 1,
                "Num": 2,
                "PT": [[3663, 1], [1667, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 30001, \"fly_num\": 2, \"fly_type\": 11, \"point_x\": -105002, \"point_y\": 0, \"point_z\": 8000, \"direction\": 270, \"length\": 10000, \"width\": 10000, \"speed\": 160, \"patrol_time\": 7200}",
                "TMID": 5479,
                "ST": 18,
                "LX": 11,
                "JB": 1,
                "Num": 2,
                "PT": [[4102, 1], [1186, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 30001, \"fly_num\": 2, \"fly_type\": 15, \"point_x\": -55000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 270, \"length\": 1000, \"width\": 1000, \"speed\": 160, \"patrol_time\": 7200}",
                "TMID": 9309,
                "ST": 18,
                "LX": 15,
                "JB": 1,
                "Num": 2,
                "PT": [[4729, 1], [4252, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffprotect\", \"airport_id\": 30001, \"fly_num\": 2, \"cov_id\": 9309, \"flag\": 1, \"offset\": 100, \"speed\": 250}",
                "TMID": 5770,
                "ST": 18,
                "LX": 11,
                "JB": 1,
                "Num": 2,
                "PT": [[709, 1], [2782, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareahunt\", \"airport_id\": 30001, \"fly_num\": 2, \"direction\": 270, \"range\": 80, \"point_x\": -129533.05624, \"point_y\": 87664.0398, \"point_z\": 7000, \"area_direct\": 270, \"area_len\": 1000, \"area_wid\": 1000, \"speed\": 160}",
                "TMID": 5555,
                "ST": 18,
                "LX": 15,
                "JB": 1,
                "Num": 2,
                "PT": [[973, 1], [2592, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareahunt\", \"airport_id\": 30001, \"fly_num\": 4, \"direction\": 270, \"range\": 80, \"point_x\": -129533.05624, \"point_y\": 87664.0398, \"point_z\": 7000, \"area_direct\": 270, \"area_len\": 1000, \"area_wid\": 1000, \"speed\": 160}",
                "TMID": 7911,
                "ST": 18,
                "LX": 15,
                "JB": 1,
                "Num": 4,
                "PT": [[3151, 1], [1684, 2], [92, 3], [3006, 4]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffprotect\", \"airport_id\": 30001, \"fly_num\": 2, \"cov_id\": 7911, \"flag\": 1, \"offset\": 100, \"speed\": 250}",
                "TMID": 7515,
                "ST": 18,
                "LX": 11,
                "JB": 1,
                "Num": 2,
                "PT": [[3849, 1], [4656, 2]]
            }
        ],
        "units": [
            {
                "type": "TARGET",         # 信息类型
                "ID": 2901,               # 平台编号
                "X": 4999.98252,          # 平台位置x轴坐标(浮点型, 单位: 米, 下同)
                "Y": 65000.13634,         # 平台位置y轴坐标
                "Z": -0.64452,            # 平台位置z轴坐标
                "JB": 1,                  # 军别(0-蓝方, 1-红方)
                "HX": 90.27797,           # 航向(浮点型, 单位: 度, [0-360])
                "SP": 0.01206,            # 速度(单位: 米/秒)
                "LX": 21,                 # 平台类型(21-护卫舰)
                "XH": "Bpk",              # 型号
                "TMID": 6048,             # 所属编队号
                "SBID": 1,                # 该平台在编队内序号
                "TM": 672.6,              # 仿真时间
                "Locked": 0,              # 是否被锁定(针对飞机而言, 0-未锁定, 1-锁定)
                "WH": 1,                  # 存活(0-死亡, 1-存活)
                "DA": 0,                  # 受损百分比(整型, [0-100])
                "Hang": 100000.0,         # 滞空时间(浮点型, 单位: 秒, 针对飞机而言, 数值不准确, 目前参考意义不大)
                "Fuel": 10000.0,          # 剩余油料(浮点型, 单位: 升)
                "ST": 41,                 # 平台状态
                "WP": {"519": 36}         # 武器字典{弹药名: 剩余数量, ...}
            },
            {
                "type": "TARGET",
                "ID": 4959,
                "X": 18014.04029,
                "Y": -10398.67663,
                "Z": 7499.98926,
                "JB": 1,
                "HX": 97.38457,
                "SP": 159.88278,
                "LX": 12,
                "XH": "AWACS",
                "TMID": 5749,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 3600.0,
                "Fuel": -1.0,
                "ST": 12,
                "WP": {}
            },
            {
                "type": "TARGET",
                "ID": 168,
                "X": 14999.98146,
                "Y": 1.17851,
                "Z": -0.55628,
                "JB": 1,
                "HX": 90.28734,
                "SP": 0.05802,
                "LX": 21,
                "XH": "Bpk",
                "TMID": 9029,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 100000.0,
                "Fuel": 10000.0,
                "ST": 41,
                "WP": {"519": 35}
            },
            {
                "type": "TARGET",
                "ID": 4069,
                "X": 145303.78125,
                "Y": -851.0976,
                "Z": 23.2862,
                "JB": 1,
                "HX": 270.00302,
                "SP": 0.0,
                "LX": 32,
                "XH": "GroundRadar2500",
                "TMID": 9359,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 100000.0,
                "Fuel": 10000.0,
                "ST": 91,
                "WP": {}
            },
            {
                "type": "TARGET",
                "ID": 1305,
                "X": 27742.10763,
                "Y": -53416.44391,
                "Z": 999.98914,
                "JB": 1,
                "HX": 83.33762,
                "SP": 50.0286,
                "LX": 14,
                "XH": "UAV",
                "TMID": 5249,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 3600.0,
                "Fuel": -1.0,
                "ST": 9,
                "WP": {}
            },
            {
                "type": "TARGET",
                "ID": 4979,
                "X": 8074.43054,
                "Y": -5259.92348,
                "Z": 7237.57822,
                "JB": 1,
                "HX": 278.85039,
                "SP": 300.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7080,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 46352.71637,
                "Fuel": 9447.53804,
                "ST": 15,
                "WP": {"170": 5}
            },
            {
                "type": "TARGET",
                "ID": 4359,
                "X": 17606.94146,
                "Y": -10345.67474,
                "Z": 7499.97635,
                "JB": 1,
                "HX": 97.45866,
                "SP": 160.21119,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7080,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 47194.64765,
                "Fuel": 9447.10015,
                "ST": 17,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 2488,
                "X": 54982.8659,
                "Y": -837.1761,
                "Z": 7291.20121,
                "JB": 1,
                "HX": 274.79369,
                "SP": 159.9707,
                "LX": 13,
                "XH": "РЭБ-SU-35",
                "TMID": 9667,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 3600.0,
                "Fuel": -1.0,
                "ST": 11,
                "WP": {}
            },
            {
                "type": "TARGET",
                "ID": 1948,
                "X": 55957.30692,
                "Y": -918.89896,
                "Z": 7221.1307,
                "JB": 1,
                "HX": 274.79389,
                "SP": 160.05643,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 8509,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 46200.04653,
                "Fuel": 9426.98079,
                "ST": 17,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 4247,
                "X": 55977.34989,
                "Y": -920.57065,
                "Z": 7219.65051,
                "JB": 1,
                "HX": 274.7933,
                "SP": 160.05643,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 8509,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 46193.41908,
                "Fuel": 9426.57854,
                "ST": 17,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 1140,
                "X": 61240.52908,
                "Y": -1291.77954,
                "Z": 3793.36886,
                "JB": 1,
                "HX": 268.75945,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5475,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36629.11865,
                "Fuel": 9411.29318,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 4663,
                "X": 61387.93534,
                "Y": 89.96481,
                "Z": 3791.89303,
                "JB": 1,
                "HX": 268.2989,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5475,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36624.12976,
                "Fuel": 9410.8913,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 3663,
                "X": 64506.54471,
                "Y": -1225.55102,
                "Z": 3719.88863,
                "JB": 1,
                "HX": 268.76093,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5285,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36453.79062,
                "Fuel": 9409.85317,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 1667,
                "X": 64653.88846,
                "Y": 182.30807,
                "Z": 3718.4814,
                "JB": 1,
                "HX": 268.30043,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5285,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36449.00099,
                "Fuel": 9409.45185,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 4102,
                "X": 67767.35721,
                "Y": -1155.02612,
                "Z": 3646.66841,
                "JB": 1,
                "HX": 268.76094,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5479,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36280.77062,
                "Fuel": 9408.43868,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 1186,
                "X": 67914.70096,
                "Y": 279.07235,
                "Z": 3645.30855,
                "JB": 1,
                "HX": 268.30044,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5479,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36276.12801,
                "Fuel": 9408.03784,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 4729,
                "X": 74465.65091,
                "Y": 22451.56274,
                "Z": 3598.74072,
                "JB": 1,
                "HX": 287.92821,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 9309,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36166.98085,
                "Fuel": 9407.14999,
                "ST": 12,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 4252,
                "X": 74403.43188,
                "Y": 23835.06576,
                "Z": 3602.7854,
                "JB": 1,
                "HX": 287.38219,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 9309,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36174.68459,
                "Fuel": 9406.77176,
                "ST": 12,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 709,
                "X": 75418.56498,
                "Y": 22143.27368,
                "Z": 3574.83158,
                "JB": 1,
                "HX": 287.92363,
                "SP": 160.05401,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5770,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36108.99337,
                "Fuel": 9406.12287,
                "ST": 17,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 2782,
                "X": 75399.54935,
                "Y": 22149.44946,
                "Z": 3575.35527,
                "JB": 1,
                "HX": 287.92385,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5770,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 36108.67294,
                "Fuel": 9405.73155,
                "ST": 17,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 973,
                "X": 82573.94279,
                "Y": 25659.86536,
                "Z": 1916.63926,
                "JB": 1,
                "HX": 292.82825,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 5555,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32303.09898,
                "Fuel": 9398.41298,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 2592,
                "X": 82530.90344,
                "Y": 27171.39779,
                "Z": 1916.81638,
                "JB": 1,
                "HX": 292.32949,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 5555,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32302.12674,
                "Fuel": 9398.01872,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 3151,
                "X": 90678.29435,
                "Y": 22265.76184,
                "Z": 1918.85932,
                "JB": 1,
                "HX": 292.82286,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 7911,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32305.40582,
                "Fuel": 9397.68768,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 1684,
                "X": 89429.3962,
                "Y": 21639.69209,
                "Z": 1919.04926,
                "JB": 1,
                "HX": 293.17892,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 7911,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32304.46327,
                "Fuel": 9397.29402,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 92,
                "X": 88588.75529,
                "Y": 23128.19348,
                "Z": 1919.34492,
                "JB": 1,
                "HX": 292.82805,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 7911,
                "SBID": 3,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32303.74532,
                "Fuel": 9396.89921,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 3006,
                "X": 88564.84095,
                "Y": 24692.31966,
                "Z": 1919.47804,
                "JB": 1,
                "HX": 292.33023,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 7911,
                "SBID": 4,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32302.67666,
                "Fuel": 9396.50466,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 3849,
                "X": 91583.42717,
                "Y": 21884.86536,
                "Z": 1918.46056,
                "JB": 1,
                "HX": 292.81934,
                "SP": 160.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7515,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32299.08306,
                "Fuel": 9396.0998,
                "ST": 17,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 4656,
                "X": 91601.85685,
                "Y": 21877.10755,
                "Z": 1918.42306,
                "JB": 1,
                "HX": 292.81688,
                "SP": 160.07032,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7515,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32297.64124,
                "Fuel": 9395.70393,
                "ST": 17,
                "WP": {"170": 6}
            }
        ],
        "qb": [
            {
                "type": "Intelligence",   # 信息类型-情报
                "ID": 4492,               # 平台编号
                "X": -101270.6908,        # x轴坐标(浮点型, 单位: 米, 下同)
                "Y": -11061.7334,         # y轴坐标
                "Z": 7499.98926,          # z轴坐标
                "JB": 2,                  # 军别(0-蓝方, 2-未知, 3-中立(即民用目标))
                "HX": 95.45454,           # 航向(浮点型, 单位: 度, [0-360])
                "SP": 159.63446,          # 速度(单位: 米/秒)
                "LX": 18,                 # 平台类型(18-未知空中目标, 28-未知水面/地面目标)
                "XH": "unknown",          # 型号
                "WH": 1,                  # 存活(0-死亡, 1-存活)
                "DA": 0,                  # 受损百分比(整型, [0-100])
                "TMID": 9146,             # 所属编队号
                "SBID": 1,                # 该平台在编队内序号
                "TM": 672.6               # 仿真时间
            },
            {
                "type": "Intelligence",
                "ID": 20001,
                "X": -130870.0,
                "Y": -86854.0,
                "Z": 103.6,
                "JB": 0,                  # 军别(0-蓝方)
                "HX": 67.85859,
                "SP": 0.0,
                "LX": 42,                 # 类型(42-机场)
                "XH": "airport",          # 型号
                "WH": 1,
                "DA": 0,
                "TMID": 20001,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 4939,
                "X": -129533.05624,
                "Y": 87664.0398,
                "Z": 89.51567,
                "JB": 0,                # 军别(0-蓝方)
                "HX": 90.0,
                "SP": 0.0,
                "LX": 41,               # 类型(41-指挥所)
                "XH": "CommandPost",    # 型号
                "WH": 1,
                "DA": 0,
                "TMID": 8276,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 65,
                "X": -11388.24439,
                "Y": -16797.47794,
                "Z": -0.14278,
                "JB": 3,
                "HX": 190.17122,
                "SP": 0.0,
                "LX": 29,
                "XH": "civil-ship",
                "WH": 1,
                "DA": 0,
                "TMID": 5529,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 1549,
                "X": -32011.71752,
                "Y": 15775.91267,
                "Z": 6132.76727,
                "JB": 0,
                "HX": 118.12715,
                "SP": 300.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 6848,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 1328,
                "X": 59566.8864,
                "Y": -71545.66429,
                "Z": 7999.98926,
                "JB": 3,
                "HX": 129.00635,
                "SP": 166.77987,
                "LX": 19,
                "XH": "civil-aircraft",
                "WH": 1,
                "DA": 0,
                "TMID": 8192,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 1903,
                "X": 42988.38961,
                "Y": -69288.41445,
                "Z": 7999.98926,
                "JB": 3,
                "HX": 134.12477,
                "SP": 166.11612,
                "LX": 19,
                "XH": "civil-aircraft",
                "WH": 1,
                "DA": 0,
                "TMID": 8415,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 4150,
                "X": 120720.23595,
                "Y": -66770.96917,
                "Z": 7999.98926,
                "JB": 3,
                "HX": 42.33547,
                "SP": 166.68035,
                "LX": 19,
                "XH": "civil-aircraft",
                "WH": 1,
                "DA": 0,
                "TMID": 9148,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 3980,
                "X": -75417.04904,
                "Y": -13932.88855,
                "Z": 1999.97827,
                "JB": 0,
                "HX": 34.61224,
                "SP": 160.01331,
                "LX": 15,
                "XH": "SU-27-A2G",
                "WH": 1,
                "DA": 0,
                "TMID": 5781,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 4531,
                "X": -74555.31862,
                "Y": -12418.64752,
                "Z": 1999.97827,
                "JB": 0,
                "HX": 35.18129,
                "SP": 159.95837,
                "LX": 15,
                "XH": "SU-27-A2G",
                "WH": 1,
                "DA": 0,
                "TMID": 5781,
                "SBID": 2,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 1975,
                "X": -43855.83267,
                "Y": 19541.15081,
                "Z": 5798.22587,
                "JB": 0,
                "HX": 38.06859,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 7297,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 773,
                "X": -7470.34341,
                "Y": -81537.66839,
                "Z": 6999.98926,
                "JB": 0,
                "HX": 95.66316,
                "SP": 249.49477,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 8412,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 232,
                "X": -76530.35116,
                "Y": 7695.55299,
                "Z": 6376.12528,
                "JB": 0,
                "HX": 27.95627,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 6700,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 3427,
                "X": -46666.09546,
                "Y": -51980.09871,
                "Z": 6999.98926,
                "JB": 0,
                "HX": 86.69579,
                "SP": 250.96013,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 7399,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 287,
                "X": -86973.37863,
                "Y": -21430.31889,
                "Z": 6206.74164,
                "JB": 0,
                "HX": 31.38641,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 9014,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 3779,
                "X": -106569.84442,
                "Y": -60563.13237,
                "Z": 2872.98086,
                "JB": 2,
                "HX": 38.0606,
                "SP": 250.0,
                "LX": 18,
                "XH": "unknown",
                "WH": 1,
                "DA": 0,
                "TMID": 9312,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 557,
                "X": -131156.63859,
                "Y": -87887.86736,
                "Z": 99.7043,
                "JB": 0,
                "HX": 90.0,
                "SP": 0.0,
                "LX": 41,
                "XH": "CommandPost",
                "WH": 1,
                "DA": 0,
                "TMID": 5077,
                "SBID": 1,
                "TM": 672.6
            }
        ],
        "rockets": [
            {
                "type": "Rocket",       # 信息类型
                "ID": 4848,             # 导弹编号
                "X": -29037.7751,       # 导弹位置x轴坐标(浮点型, 单位: 米)
                "Y": 14189.4392,        # 导弹位置y轴坐标
                "Z": 6195.2221,         # 导弹位置z轴坐标
                "FY": 1.44,             # 俯仰角度(浮点型, 单位: 度)
                "HG": 0.0171,           # 横滚角
                "HX": 117.8445,         # 航向, 即偏航角
                "GJSX": 0,              # 来袭导弹所属军别
                "N1": 1549,             # 来袭导弹发射平台编号
                "N2": 4979,             # 来袭导弹目标平台编号
                "WH": 1,                # 是否存活/爆炸(0-已爆炸, 1-未爆炸)
                "TM": 672.6             # 仿真时间
            }
        ]
    },
    "blue": {
        "airports": [
            {
                "type": "AIRPORT",    # 信息类型-机场
                "ID": 20001,          # 机场编号
                "JB": 0,              # 军别信息(0-蓝方, 1-红方)
                "CA": 50,             # 容量(单位: 架, 下同)
                "NM": 4,              # 机场停放的飞机数量
                "KY": 4,              # 可用飞机总数
                "AIR": 0,             # 可用歼击机数量
                "AWCS": 0,            # 可用预警机数量
                "JAM": 0,             # 可用干扰机数量
                "UAV": 0,             # 可用无人侦察机数量
                "BOM": 4,             # 可用轰炸机数量
                "X": -130870.0,       # 机场x轴坐标(单位: 米, 下同)
                "Y": -86854.0,        # 机场y轴坐标
                "Z": 103.6,           # 机场z轴坐标
                "WH": 1,              # 是否存活(机场存活信息一直为1)
                "DA": 0               # 机场修复时间(整型, 单位: 秒)
            }
        ],
        "teams": [
            {
                "type": "TEAMS",        # 信息类型
                "Task": "",             # 上一指令信息(json串形式, 默认为"")
                "TMID": 6801,           # 编队编号(整型, 下同)
                "ST": 0,                # 编队状态编码
                "LX": 21,               # 编队类型编码(整型, 这里21为护卫舰)
                "JB": 0,                # 军别(0-蓝方, 1-红方)
                "Num": 1,               # 编队内平台数量(整型)
                "PT": [[2207, 1]]       # 编队内平台列表[[平台编号, 队内序号], ...]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"awcs_areapatrol\", \"self_id\": 4492, \"point_x\": -100000, \"point_y\": 0, \"point_z\": 7500, \"direction\": 270, \"length\": 20000, \"width\": 20000, \"speed\": 160, \"patrol_time\": 7200, \"patrol_mode\": 2}",
                "TMID": 9146,
                "ST": 51,
                "LX": 12,
                "JB": 0,
                "Num": 1,
                "PT": [[4492, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 6151,
                "ST": 0,
                "LX": 32,
                "JB": 0,
                "Num": 1,
                "PT": [[521, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 8091,
                "ST": 0,
                "LX": 32,
                "JB": 0,
                "Num": 1,
                "PT": [[1122, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 7144,
                "ST": 0,
                "LX": 31,
                "JB": 0,
                "Num": 1,
                "PT": [[3651, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 5077,
                "ST": 0,
                "LX": 41,
                "JB": 0,
                "Num": 1,
                "PT": [[557, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 8276,
                "ST": 0,
                "LX": 41,
                "JB": 0,
                "Num": 1,
                "PT": [[4939, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 6093,
                "ST": 0,
                "LX": 31,
                "JB": 0,
                "Num": 1,
                "PT": [[2314, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "",
                "TMID": 6501,
                "ST": 0,
                "LX": 31,
                "JB": 0,
                "Num": 1,
                "PT": [[4821, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"airattack\", \"self_id\": 1549, \"target_id\": 4359, \"type\": 1}",
                "TMID": 6848,
                "ST": 16,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[1549, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareahunt\", \"airport_id\": 20001, \"fly_num\": 2, \"direction\": 90, \"range\": 100, \"point_x\": 14999.98145, \"point_y\": 0.36434, \"point_z\": 5000, \"area_direct\": 90, \"area_len\": 1000, \"area_wid\": 1000, \"speed\": 160}",
                "TMID": 5781,
                "ST": 18,
                "LX": 15,
                "JB": 0,
                "Num": 2,
                "PT": [[3980, 1], [4531, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 7297,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[1975, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": -65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 8412,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[773, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -55000, \"point_y\": 35000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 6700,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[232, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -55000, \"point_y\": -35000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 7399,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[3427, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -65000, \"point_y\": 5000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 9014,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[287, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareahunt\", \"airport_id\": 20001, \"fly_num\": 2, \"direction\": 90, \"range\": 100, \"point_x\": 4999.98438, \"point_y\": 65000.14062, \"point_z\": 5000, \"area_direct\": 90, \"area_len\": 1000, \"area_wid\": 1000, \"speed\": 160}",
                "TMID": 7919,
                "ST": 18,
                "LX": 15,
                "JB": 0,
                "Num": 2,
                "PT": [[2451, 1], [2995, 2]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 9312,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[3779, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 9437,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[1919, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 5093,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[3156, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 7913,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[805, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 7425,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[4260, 1]]
            },
            {
                "type": "TEAMS",
                "Task": "{\"maintype\": \"takeoffareapatrol\", \"airport_id\": 20001, \"fly_num\": 1, \"fly_type\": 11, \"point_x\": -5000, \"point_y\": 65000, \"point_z\": 7000, \"direction\": 90, \"length\": 30000, \"width\": 30000, \"speed\": 250, \"patrol_time\": 7200}",
                "TMID": 5007,
                "ST": 18,
                "LX": 11,
                "JB": 0,
                "Num": 1,
                "PT": [[2443, 1]]
            }
        ],
        "units": [
            {
                "type": "TARGET",             # 信息类型
                "ID": 2207,                   # 平台编号
                "X": -105218.71868,           # 平台位置x轴坐标(浮点型, 单位: 米, 下同)
                "Y": 68644.7195,              # 平台位置y轴坐标
                "Z": -0.64348,                # 平台位置z轴坐标
                "JB": 0,                      # 军别(0-蓝方, 1-红方)
                "HX": 90.00052,               # 航向(浮点型, 单位: 度, [0-360])
                "SP": 0.04917,                # 速度(单位: 米/秒)
                "LX": 21,                     # 平台类型(21-护卫舰)
                "XH": "Bpk",                  # 型号
                "TMID": 6801,                 # 所属编队号
                "SBID": 1,                    # 该平台在编队内序号
                "TM": 672.6,                  # 仿真时间
                "Locked": 0,                  # 是否被锁定(针对飞机而言, 0-未锁定, 1-锁定)
                "WH": 1,                      # 存活(0-死亡, 1-存活)
                "DA": 0,                      # 受损百分比(整型, [0-100])
                "Hang": 100000.0,             # 滞空时间(浮点型, 单位: 秒, 针对飞机而言, 数值不准确, 目前参考意义不大)
                "Fuel": 10000.0,              # 剩余油料(浮点型, 单位: 升)
                "ST": 41,                     # 平台状态
                "WP": {"519": 36}             # 武器字典{弹药名: 剩余数量, ...}
            },
            {
                "type": "COMMAND",            # 信息类型-指挥所
                "TMID": 5077,                 # 所属编队号
                "ID": 557,                    # 平台编号
                "X": -131156.63859,           # x轴坐标
                "Y": -87887.86736,            # y轴坐标
                "Z": 99.7043,                 # z轴坐标
                "JB": 0,                      # 军别(0-蓝方, 1-红方)
                "LX": 41,                     # 类型
                "HIT": 0,                     # 是否被击中(0-未被击中, 1-被击中)
                "WH": 1,                      # 存活(0-死亡, 1-存活)
                "DA": 0                       # 受损百分比(整型, [0-100])
            },
            {
                "type": "TARGET",
                "ID": 521,
                "X": -134172.03125,
                "Y": -91792.375,
                "Z": 152.8351,
                "JB": 0,
                "HX": 90.0,
                "SP": 0.0,
                "LX": 32,
                "XH": "GroundRadar2500",
                "TMID": 6151,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 100000.0,
                "Fuel": 10000.0,
                "ST": 91,
                "WP": {}
            },
            {
                "type": "TARGET",
                "ID": 1122,
                "X": -131943.35938,
                "Y": 83707.59375,
                "Z": 154.34856,
                "JB": 0,
                "HX": 90.00397,
                "SP": 0.0,
                "LX": 32,
                "XH": "GroundRadar2500",
                "TMID": 8091,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 100000.0,
                "Fuel": 10000.0,
                "ST": 91,
                "WP": {}
            },
            {
                "type": "TARGET",
                "ID": 3651,
                "X": -126629.25,
                "Y": 86387.625,
                "Z": 13.30659,
                "JB": 0,
                "HX": 89.99863,
                "SP": 0.0,
                "LX": 31,
                "XH": "Shell-C1",
                "TMID": 7144,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 100000.0,
                "Fuel": 10000.0,
                "ST": 32,
                "WP": {"170": 12}
            },
            {
                "type": "COMMAND",
                "TMID": 8276,
                "ID": 4939,
                "X": -129533.05624,
                "Y": 87664.0398,
                "Z": 89.51567,
                "JB": 0,
                "LX": 41,
                "HIT": 0,
                "WH": 1,
                "DA": 0
            },
            {
                "type": "TARGET",
                "ID": 2314,
                "X": -129608.90625,
                "Y": -85491.21094,
                "Z": 0.97002,
                "JB": 0,
                "HX": 90.00027,
                "SP": 0.0,
                "LX": 31,
                "XH": "Shell-C1",
                "TMID": 6093,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 100000.0,
                "Fuel": 10000.0,
                "ST": 32,
                "WP": {"170": 12}
            },
            {
                "type": "TARGET",
                "ID": 4821,
                "X": -128408.90625,
                "Y": -88171.21094,
                "Z": 7.48291,
                "JB": 0,
                "HX": 89.99958,
                "SP": 0.0,
                "LX": 31,
                "XH": "Shell-C1",
                "TMID": 6501,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 100000.0,
                "Fuel": 10000.0,
                "ST": 32,
                "WP": {"170": 12}
            },
            {
                "type": "TARGET",
                "ID": 4492,
                "X": -100793.05618,
                "Y": -11106.15086,
                "Z": 7499.98926,
                "JB": 0,
                "HX": 95.16715,
                "SP": 159.70423,
                "LX": 12,
                "XH": "AWACS",
                "TMID": 9146,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 3600.0,
                "Fuel": -1.0,
                "ST": 12,
                "WP": {}
            },
            {
                "type": "TARGET",
                "ID": 1549,
                "X": -31217.36625,
                "Y": 15353.37107,
                "Z": 6154.00714,
                "JB": 0,
                "HX": 117.82985,
                "SP": 300.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 6848,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 43066.32226,
                "Fuel": 9426.00228,
                "ST": 13,
                "WP": {"170": 5}
            },
            {
                "type": "TARGET",
                "ID": 3980,
                "X": -75144.40389,
                "Y": -13537.84124,
                "Z": 1999.97827,
                "JB": 0,
                "HX": 34.61224,
                "SP": 159.96206,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 5781,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32503.94264,
                "Fuel": 9404.10385,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 4531,
                "X": -74278.75971,
                "Y": -12026.32713,
                "Z": 1999.97827,
                "JB": 0,
                "HX": 35.18129,
                "SP": 159.95245,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 5781,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32502.67702,
                "Fuel": 9403.73767,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 1975,
                "X": -43393.48175,
                "Y": 20131.30748,
                "Z": 5820.55232,
                "JB": 0,
                "HX": 38.06844,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7297,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 42070.50998,
                "Fuel": 9420.96112,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 773,
                "X": -6724.14812,
                "Y": -81609.85581,
                "Z": 6999.98926,
                "JB": 0,
                "HX": 95.38403,
                "SP": 251.04152,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 8412,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 45497.72716,
                "Fuel": 9423.44705,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 232,
                "X": -76179.13636,
                "Y": 8357.34818,
                "Z": 6408.74336,
                "JB": 0,
                "HX": 27.95637,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 6700,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 43723.59746,
                "Fuel": 9415.13014,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 3427,
                "X": -45917.8858,
                "Y": -51927.62051,
                "Z": 6999.98926,
                "JB": 0,
                "HX": 85.24102,
                "SP": 249.37357,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7399,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 45461.39422,
                "Fuel": 9415.9218,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 287,
                "X": -86583.45682,
                "Y": -20791.11435,
                "Z": 6250.15512,
                "JB": 0,
                "HX": 31.38657,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 9014,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 43237.02547,
                "Fuel": 9405.61478,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 2451,
                "X": -117187.54022,
                "Y": -60574.81505,
                "Z": 1954.29664,
                "JB": 0,
                "HX": 18.23237,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 7919,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32355.69469,
                "Fuel": 9389.99149,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 2995,
                "X": -116958.454,
                "Y": -58549.5105,
                "Z": 1954.46449,
                "JB": 0,
                "HX": 18.42032,
                "SP": 160.0,
                "LX": 15,
                "XH": "SU-27-A2G",
                "TMID": 7919,
                "SBID": 2,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32354.76131,
                "Fuel": 9389.61487,
                "ST": 11,
                "WP": {"360": 2}
            },
            {
                "type": "TARGET",
                "ID": 3779,
                "X": -106107.8451,
                "Y": -59972.7999,
                "Z": 2894.03277,
                "JB": 0,
                "HX": 38.06067,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 9312,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 34529.54597,
                "Fuel": 9389.06852,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 1919,
                "X": -117055.91541,
                "Y": -73950.62419,
                "Z": 2396.64091,
                "JB": 0,
                "HX": 38.06168,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 9437,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 33329.50779,
                "Fuel": 9385.5451,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 3156,
                "X": -118626.55604,
                "Y": -75956.35857,
                "Z": 2325.51297,
                "JB": 0,
                "HX": 38.06171,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5093,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 33164.80861,
                "Fuel": 9385.09663,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 805,
                "X": -120197.19666,
                "Y": -77962.09294,
                "Z": 2254.42947,
                "JB": 0,
                "HX": 38.06174,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7913,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 33001.86522,
                "Fuel": 9384.66272,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 4260,
                "X": -121767.83729,
                "Y": -79967.82732,
                "Z": 2183.38796,
                "JB": 0,
                "HX": 38.06178,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 7425,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32840.66374,
                "Fuel": 9384.24867,
                "ST": 12,
                "WP": {"170": 6}
            },
            {
                "type": "TARGET",
                "ID": 2443,
                "X": -123338.47791,
                "Y": -81973.56169,
                "Z": 2112.41628,
                "JB": 0,
                "HX": 38.0618,
                "SP": 250.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "TMID": 5007,
                "SBID": 1,
                "TM": 672.6,
                "Locked": 0,
                "WH": 1,
                "DA": 0,
                "Hang": 32681.19927,
                "Fuel": 9383.843,
                "ST": 12,
                "WP": {
                  "170": 6
                }
            }
        ],
        "qb": [
            {
                "type": "Intelligence",       # 信息类型-情报
                "ID": 3695,                   # 平台编号
                "X": -79530.32479,            # x轴坐标(浮点型, 单位: 米, 下同)
                "Y": -62197.40873,            # y轴坐标
                "Z": 7999.98926,              # z轴坐标
                "JB": 3,                      # 军别(1-红方, 2-未知, 3-中立(即民用目标))
                "HX": 113.38897,              # 航向(浮点型, 单位: 度, [0-360])
                "SP": 166.62482,              # 速度(单位: 米/秒)
                "LX": 19,                     # 平台类型(19-民航)
                "XH": "civil-aircraft",       # 型号
                "WH": 1,                      # 存活(0-死亡, 1-存活)
                "DA": 0,                      # 受损百分比(整型, [0-100])
                "TMID": 8127,                 # 所属编队号
                "SBID": 1,                    # 该平台在编队内序号
                "TM": 672.6                   # 仿真时间
            },
            {
                "type": "Intelligence",
                "ID": 1305,
                "X": 27592.637,
                "Y": -53433.62797,
                "Z": 999.98914,
                "JB": 1,                      # 军别(1-红方)
                "HX": 83.54754,
                "SP": 50.2424,
                "LX": 14,                     # 平台类型(14-无人侦察机)
                "XH": "UAV",
                "WH": 1,
                "DA": 0,
                "TMID": 5249,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 3362,
                "X": -3401.38439,
                "Y": -53806.7056,
                "Z": 7999.98926,
                "JB": 3,
                "HX": 72.06689,
                "SP": 166.88641,
                "LX": 19,
                "XH": "civil-aircraft",
                "WH": 1,
                "DA": 0,
                "TMID": 7778,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 1102,
                "X": -69320.04892,
                "Y": -63877.95306,
                "Z": 7999.98926,
                "JB": 3,
                "HX": 114.9185,
                "SP": 166.40455,
                "LX": 19,
                "XH": "civil-aircraft",
                "WH": 1,
                "DA": 0,
                "TMID": 9842,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 13,
                "X": -6029.14932,
                "Y": -106770.45841,
                "Z": -0.11435,
                "JB": 3,
                "HX": 189.17084,
                "SP": 0.0,
                "LX": 29,
                "XH": "civil-ship",
                "WH": 1,
                "DA": 0,
                "TMID": 5192,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 1941,
                "X": -3940.27414,
                "Y": -22251.42726,
                "Z": -0.15246,
                "JB": 3,
                "HX": 210.74829,
                "SP": 0.0,
                "LX": 29,
                "XH": "civil-ship",
                "WH": 1,
                "DA": 0,
                "TMID": 6599,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 3479,
                "X": -61387.74314,
                "Y": -105691.05532,
                "Z": -0.15995,
                "JB": 3,
                "HX": 283.53383,
                "SP": 0.0,
                "LX": 29,
                "XH": "civil-ship",
                "WH": 1,
                "DA": 0,
                "TMID": 6018,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 168,
                "X": 14999.9833,
                "Y": 1.17562,
                "Z": -0.64277,
                "JB": 1,
                "HX": 90.28747,
                "SP": 0.01667,
                "LX": 21,
                "XH": "Bpk",
                "WH": 1,
                "DA": 0,
                "TMID": 9029,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 4959,
                "X": 17537.70619,
                "Y": -10336.65382,
                "Z": 7499.98926,
                "JB": 1,
                "HX": 97.45078,
                "SP": 160.33466,
                "LX": 12,
                "XH": "AWACS",
                "WH": 1,
                "DA": 0,
                "TMID": 5749,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 2901,
                "X": 4999.98535,
                "Y": 65000.12891,
                "Z": -0.58856,
                "JB": 1,
                "HX": 90.27793,
                "SP": 0.00959,
                "LX": 21,
                "XH": "Bpk",
                "WH": 1,
                "DA": 0,
                "TMID": 6048,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 4979,
                "X": 8963.70892,
                "Y": -5398.409,
                "Z": 7237.82547,
                "JB": 1,
                "HX": 278.85098,
                "SP": 300.0,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 7080,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 4359,
                "X": 17130.9682,
                "Y": -10283.24684,
                "Z": 7499.96746,
                "JB": 1,
                "HX": 97.50209,
                "SP": 159.83716,
                "LX": 11,
                "XH": "SU-27-A2A",
                "WH": 1,
                "DA": 0,
                "TMID": 7080,
                "SBID": 2,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 1948,
                "X": 57245.52558,
                "Y": -1026.96923,
                "Z": 7129.55117,
                "JB": 2,
                "HX": 274.79759,
                "SP": 160.01089,
                "LX": 18,
                "XH": "unknown",
                "WH": 1,
                "DA": 0,
                "TMID": 8509,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 2488,
                "X": 56271.11543,
                "Y": -945.2101,
                "Z": 7199.73504,
                "JB": 2,
                "HX": 274.79368,
                "SP": 160.07786,
                "LX": 18,
                "XH": "unknown",
                "WH": 1,
                "DA": 0,
                "TMID": 9667,
                "SBID": 1,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 4247,
                "X": 57265.56855,
                "Y": -1028.60058,
                "Z": 7128.06522,
                "JB": 2,
                "HX": 274.79341,
                "SP": 160.01089,
                "LX": 18,
                "XH": "unknown",
                "WH": 1,
                "DA": 0,
                "TMID": 8509,
                "SBID": 2,
                "TM": 672.6
            },
            {
                "type": "Intelligence",
                "ID": 30001,
                "X": 146228.0,
                "Y": -1965.0,
                "Z": 12.1,
                "JB": 1,
                "HX": -47.33699,
                "SP": 0.0,
                "LX": 42,
                "XH": "airport",
                "WH": 1,
                "DA": 0,
                "TMID": 30001,
                "SBID": 1,
                "TM": 672.6
            }
        ],
        "rockets": [
            {
                "type": "Rocket",     # 信息类型
                "ID": 4527,           # 导弹编号
                "X": 47.5813,         # 导弹位置x轴坐标(浮点型, 单位: 米)
                "Y": 5143.7549,       # 导弹位置y轴坐标
                "Z": 2285.0684,       # 导弹位置z轴坐标
                "FY": 6.8116,         # 俯仰角度(浮点型, 单位: 度)
                "HG": -149.7087,      # 横滚角
                "HX": -72.0413,       # 航向, 即偏航角
                "GJSX": 1,            # 来袭导弹所属军别
                "N1": 168,            # 来袭导弹发射平台编号
                "N2": 1549,           # 来袭导弹目标平台编号
                "WH": 1,              # 是否存活/爆炸(0-已爆炸, 1-未爆炸)
                "TM": 672.6           # 仿真时间
            },
            {
                "type": "Rocket",
                "ID": 307,
                "X": 6794.3693,
                "Y": -4084.9532,
                "Z": 7127.2579,
                "FY": -1.3079,
                "HG": -0.0975,
                "HX": -62.924,
                "GJSX": 1,
                "N1": 4979,
                "N2": 1549,
                "WH": 1,
                "TM": 672.6
            }
        ]
    }
}
